
<!DOCTYPE HTML>
<html lang="ja" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Function · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="view.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="検索すると入力" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="directory.html">
            
                <a href="directory.html">
            
                    
                    Directory
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="view.html">
            
                <a href="view.html">
            
                    
                    View
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="function.html">
            
                <a href="function.html">
            
                    
                    Function
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBookで公開 
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Function</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6A5F;&#x80FD;&#x6982;&#x8981;">&#x6A5F;&#x80FD;&#x6982;&#x8981;</h1>
<h2 id="&#x30E1;&#x30CB;&#x30E5;&#x30FC;">&#x30E1;&#x30CB;&#x30E5;&#x30FC;</h2>
<p>&#x67A0;&#x3084;&#x5439;&#x304D;&#x51FA;&#x3057;&#x306A;&#x3069;&#x3001;&#x753B;&#x9762;&#x4E0A;&#x306B;&#x63CF;&#x753B;&#x3059;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306B;&#x5FDC;&#x3058;&#x3066;&#x5207;&#x308A;&#x66FF;&#x3048;&#x308B;&#x3002;
&#x307E;&#x305F;&#x3001;&#x5229;&#x4FBF;&#x6027;&#x3092;&#x5411;&#x4E0A;&#x3055;&#x305B;&#x308B;&#x305F;&#x3081;&#x3001;&#x5404;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x30DC;&#x30BF;&#x30F3;&#x306F;&#x3001;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x30AD;&#x30FC;&#x3092;
&#x62BC;&#x4E0B;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3082;&#x5207;&#x308A;&#x66FF;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x30AD;&#x30FC;&#x306E;&#x8A73;&#x7D30;&#x306F;&#x5F8C;&#x8FF0;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x3067;&#x306F;&#x3001;&#x5404;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306E;&#x6982;&#x8981;&#x306B;&#x3064;&#x3044;&#x3066;&#x8A18;&#x8FF0;&#x3059;&#x308B;&#x3002;</p>
<h3 id="&#x67A0;">&#x67A0;</h3>
<p>&#x753B;&#x9762;&#x4E0A;&#x306B;&#x8D64;&#x306E;&#x67A0;&#x7DDA;&#x3092;&#x63CF;&#x753B;&#x3059;&#x308B;&#x3002;
&#x753B;&#x9762;&#x4E0A;&#x306E;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3055;&#x308C;&#x305F;&#x4F4D;&#x7F6E;&#x3092;&#x59CB;&#x70B9;&#x3068;&#x3057;&#x3001;&#x30DE;&#x30A6;&#x30B9;&#x304C;&#x96E2;&#x3055;&#x308C;&#x305F;&#x6642;&#x70B9;&#x3067;&#x306E;&#x5EA7;&#x6A19;&#x3092;&#x3082;&#x3068;&#x306B;&#x5C0E;&#x51FA;&#x3055;&#x308C;&#x305F;&#x5927;&#x304D;&#x3055;&#x306E;&#x67A0;&#x304C;&#x63CF;&#x753B;&#x3055;&#x308C;&#x308B;&#x3002;
&#x3053;&#x306E;&#x3068;&#x304D;&#x3001;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x305F;&#x4F4D;&#x7F6E;&#x306B;&#x65E2;&#x306B;&#x67A0;&#x304C;&#x63CF;&#x753B;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#x5834;&#x5408;&#x3001;&#x65E2;&#x5B58;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x30EA;&#x30B5;&#x30A4;&#x30BA;&#x304C;&#x884C;&#x308F;&#x308C;&#x308B;&#x3002;
&#x30EA;&#x30B5;&#x30A4;&#x30BA;&#x306E;&#x5411;&#x304D;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x3001;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x30D5;&#x30A9;&#x30FC;&#x30AB;&#x30B9;&#x3057;&#x305F;&#x6642;&#x70B9;&#x3067;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x306B;&#x6E96;&#x3058;&#x305F;&#x65B9;&#x5411;&#x3068;&#x3059;&#x308B;&#x3002;</p>
<h3 id="&#x30C6;&#x30AD;&#x30B9;&#x30C8;">&#x30C6;&#x30AD;&#x30B9;&#x30C8;</h3>
<p>&#x753B;&#x9762;&#x4E0A;&#x306B;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3092;&#x63CF;&#x753B;&#x3059;&#x308B;&#x3002;
&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306F;&#x3001;&#x753B;&#x9762;&#x4E0A;&#x306E;&#x4EFB;&#x610F;&#x306E;&#x4F4D;&#x7F6E;&#x306B;&#x63CF;&#x753B;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;&#x304C;&#x3001;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3092;&#x5185;&#x5305;&#x53EF;&#x80FD;&#x306A;&#x56F3;&#x5F62;&#x306E;&#x5185;&#x90E8;&#x3067;&#x63CF;&#x753B;&#x3059;&#x308B;&#x969B;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x5236;&#x7D04;&#x304C;&#x751F;&#x3058;&#x308B;&#x3002;</p>
<ul>
<li>&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x304C;&#x63CF;&#x753B;&#x3055;&#x308C;&#x308B;&#x59CB;&#x70B9;&#x306F;&#x3001;&#x56F3;&#x5F62;&#x306E;&#x63CF;&#x753B;&#x59CB;&#x70B9;&#x306B;&#x6E96;&#x305A;&#x308B;</li>
<li>&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306E;&#x5E45;&#x306F;&#x3001;&#x56F3;&#x5F62;&#x306E;&#x5E45;&#x3068;&#x9023;&#x52D5;&#x3059;&#x308B;</li>
</ul>
<p>&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306F;&#x3001;&#x753B;&#x9762;&#x306B;&#x63CF;&#x753B;&#x3057;&#x305F;&#x5F8C;&#x306B;&#x3082;&#x7DE8;&#x96C6;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308A;&#x3001;&#x753B;&#x9762;&#x4E0A;&#x3067;&#x3082;&#x8996;&#x899A;&#x7684;&#x306B;&#x5224;&#x65AD;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x3001;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x304C;&#x300C;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x5165;&#x529B;&#x30E2;&#x30FC;&#x30C9;&#x300D;&#x3078;&#x3068;&#x5207;&#x308A;&#x66FF;&#x308F;&#x308B;&#x3002;</p>
<h3 id="&#x5439;&#x304D;&#x51FA;&#x3057;">&#x5439;&#x304D;&#x51FA;&#x3057;</h3>
<p>&#x753B;&#x9762;&#x4E0A;&#x306B;&#x8D64;&#x67A0;&#x767D;&#x5857;&#x308A;&#x306E;&#x5439;&#x304D;&#x51FA;&#x3057;&#x3092;&#x63CF;&#x753B;&#x3059;&#x308B;&#x3002;
&#x5439;&#x304D;&#x51FA;&#x3057;&#x306F;&#x3001;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3092;&#x5185;&#x5305;&#x53EF;&#x80FD;&#x306A;&#x56F3;&#x5F62;&#x3067;&#x3042;&#x308A;&#x3001;&#x67A0;&#x7DDA;&#x3068;&#x540C;&#x69D8;&#x3001;&#x30EA;&#x30B5;&#x30A4;&#x30BA;&#x3092;&#x53EF;&#x80FD;&#x3068;&#x3059;&#x308B;&#x3002;
&#x3044;&#x308F;&#x3086;&#x308B;&#x5439;&#x304D;&#x51FA;&#x3057;&#x306E;&#x300C;&#x3057;&#x3063;&#x307D;&#x300D;&#x90E8;&#x5206;&#x306F;&#x3001;&#x5439;&#x304D;&#x51FA;&#x3057;&#x306E;&#x5927;&#x304D;&#x3055;&#x304B;&#x3089;&#x56FA;&#x5B9A;&#x3067;&#x63CF;&#x753B;&#x3055;&#x308C;&#x3001;&#x300C;&#x3057;&#x3063;&#x307D;&#x300D;&#x90E8;&#x5206;&#x5358;&#x4F53;&#x3067;&#x306F;&#x7DE8;&#x96C6;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3082;&#x306E;&#x3068;&#x3059;&#x308B;&#x3002;</p>
<h3 id="&#x753B;&#x50CF;">&#x753B;&#x50CF;</h3>
<p>&#x300C;Ctrl + V&#x300D;&#x30AD;&#x30FC;&#x304C;&#x62BC;&#x4E0B;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x30AF;&#x30EA;&#x30C3;&#x30D7;&#x30DC;&#x30FC;&#x30C9;&#x306B;&#x30B3;&#x30D4;&#x30FC;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x753B;&#x50CF;&#x3092;&#x753B;&#x9762;&#x4E0A;&#x306B;&#x63CF;&#x753B;&#x3059;&#x308B;&#x3002;
&#x3053;&#x306E;&#x3068;&#x304D;&#x3001;&#x753B;&#x9762;&#x9818;&#x57DF;&#x3088;&#x308A;&#x3082;&#x5927;&#x304D;&#x306A;&#x30B5;&#x30A4;&#x30BA;&#x306E;&#x753B;&#x50CF;&#x306F;&#x81EA;&#x52D5;&#x3067;&#x30EA;&#x30B5;&#x30A4;&#x30BA;&#x3055;&#x308C;&#x308B;&#x3002;&#x307E;&#x305F;&#x3001;&#x753B;&#x50CF;&#x306F;&#x3001;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x4E0A;&#x3067;&#x306F;&#x3001;&#x30EA;&#x30B5;&#x30A4;&#x30BA;&#x53EF;&#x80FD;&#x306A;&#x56DB;&#x89D2;&#x3068;&#x3057;&#x3066;&#x6271;&#x308F;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;
&#x4EFB;&#x610F;&#x306E;&#x5927;&#x304D;&#x3055;&#x306B;&#x30EA;&#x30B5;&#x30A4;&#x30BA;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;&#x3002;</p>
<h3 id="&#x79FB;&#x52D5;">&#x79FB;&#x52D5;</h3>
<p>&#x753B;&#x9762;&#x4E0A;&#x306B;&#x63CF;&#x753B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x79FB;&#x52D5;&#x3059;&#x308B;&#x3002;
&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4ED8;&#x8FD1;&#x3067;&#x30DE;&#x30A6;&#x30B9;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x3001;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x304C;&#x30DE;&#x30A6;&#x30B9;&#x306E;&#x4F4D;&#x7F6E;&#x3092;&#x8FFD;&#x5F93;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308A;&#x3001;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x304C;&#x89E3;&#x9664;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x305D;&#x306E;&#x6642;&#x70B9;&#x306E;&#x5EA7;&#x6A19;&#x3078;
&#x56F3;&#x5F62;&#x304C;&#x518D;&#x914D;&#x7F6E;&#x3055;&#x308C;&#x308B;&#x3002;&#x307E;&#x305F;&#x3001;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x304C;&#x79FB;&#x52D5;&#x53EF;&#x80FD;&#x306A;&#x3068;&#x304D;&#x306F;&#x3001;&#x30DE;&#x30A6;&#x30B9;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x304C;&#x300C;&#x63B4;&#x3080;&#x30E2;&#x30FC;&#x30C9;&#x300D;&#x306E;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3078;&#x3068;&#x5909;&#x5316;&#x3059;&#x308B;&#x3002;</p>
<h3 id="&#x524A;&#x9664;">&#x524A;&#x9664;</h3>
<p>&#x753B;&#x9762;&#x4E0A;&#x306B;&#x63CF;&#x753B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x524A;&#x9664;&#x3059;&#x308B;&#x3002;
&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4ED8;&#x8FD1;&#x3067;&#x30DE;&#x30A6;&#x30B9;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x3001;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x304C;&#x753B;&#x9762;&#x4E0A;&#x304B;&#x3089;&#x524A;&#x9664;&#x3055;&#x308C;&#x308B;&#x3002;
&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x304C;&#x524A;&#x9664;&#x5BFE;&#x8C61;&#x3068;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;&#x306F;&#x3001;&#x30DE;&#x30A6;&#x30B9;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x304C;&#x300C;&#x63B4;&#x3080;&#x30E2;&#x30FC;&#x30C9;&#x300D;&#x306E;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3068;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;&#x5426;&#x304B;&#x3067;&#x5224;&#x5225;&#x3059;&#x308B;&#x3002;</p>
<h2 id="&#x30BB;&#x30EB;">&#x30BB;&#x30EB;</h2>
<p>&#x672C;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306F;&#x3001;Excel&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x76F4;&#x63A5;&#x7DE8;&#x96C6;&#x3057;&#x305F;&#x63CF;&#x753B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x4EE3;&#x66FF;&#x3068;&#x306A;&#x308B;&#x3082;&#x306E;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3001;&#x76EE;&#x7684;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;
&#x307E;&#x305F;&#x3001;Excel&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x3001;&#x30BB;&#x30EB;&#x306E;&#x5927;&#x304D;&#x3055;&#x306F;&#x56FA;&#x5B9A;&#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x3088;&#x3063;&#x3066;&#x5909;&#x52D5;&#x3057;&#x5F97;&#x308B;&#x3082;&#x306E;&#x306A;&#x306E;&#x3067;&#x3001;
&#x30BB;&#x30EB;&#x306E;&#x5927;&#x304D;&#x3055;&#x3082;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306B;&#x5FDC;&#x3058;&#x3066;&#x5909;&#x66F4;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x306E;&#x5165;&#x529B;&#x5024;&#x306B;&#x57FA;&#x3065;&#x3044;&#x3066;&#x63CF;&#x753B;&#x3059;&#x308B;&#x3002;
&#x3053;&#x308C;&#x306F;&#x3001;Excel&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x3001;&#x900F;&#x660E;&#x8272;&#x3092;&#x300C;&#x9ED2;&#x300D;&#x3068;&#x5224;&#x65AD;&#x3057;&#x3001;&#x63CF;&#x753B;&#x5BFE;&#x8C61;&#x304C;&#x900F;&#x660E;&#x306A;&#x307E;&#x307E;&#x3067;&#x306F;&#x3001;&#x6B63;&#x5E38;&#x306B;&#x8CBC;&#x4ED8;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x3053;&#x3068;&#x306B;&#x3088;&#x308B;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x3067;&#x306F;&#x3001;&#x30BB;&#x30EB;&#x306E;&#x63CF;&#x753B;&#x6A5F;&#x80FD;&#x306B;&#x3064;&#x3044;&#x3066;&#x8A18;&#x8FF0;&#x3059;&#x308B;&#x3002;</p>
<h3 id="&#x30BB;&#x30EB;&#x5E45;">&#x30BB;&#x30EB;&#x5E45;</h3>
<p>&#x5165;&#x529B;&#x3055;&#x308C;&#x305F;&#x6570;&#x5024;&#x304C;&#x753B;&#x9762;&#x4E0A;&#x306B;&#x63CF;&#x753B;&#x3055;&#x308C;&#x308B;&#x30BB;&#x30EB;&#x5E45;&#x3068;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x3002;
&#x30BB;&#x30EB;&#x306E;&#x9AD8;&#x3055;&#x304C;&#x3042;&#x308F;&#x305B;&#x3066;&#x5165;&#x529B;&#x3055;&#x308C;&#x305F;&#x6BB5;&#x968E;&#x3067;&#x30D0;&#x30EA;&#x30C7;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30FB;&#x63CF;&#x753B;&#x51E6;&#x7406;&#x3092;&#x884C;&#x3046;&#x3002;
&#x3044;&#x305A;&#x308C;&#x304B;&#x304C;&#x6570;&#x5024;&#x3067;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x30BB;&#x30EB;&#x306E;&#x63CF;&#x753B;&#x306F;&#x884C;&#x308F;&#x305A;&#x3001;&#x5165;&#x529B;&#x5024;&#x3092;&#x30AF;&#x30EA;&#x30A2;&#x3059;&#x308B;&#x3002;</p>
<h3 id="&#x30BB;&#x30EB;&#x9AD8;&#x3055;">&#x30BB;&#x30EB;&#x9AD8;&#x3055;</h3>
<p>&#x5165;&#x529B;&#x3055;&#x308C;&#x305F;&#x6570;&#x5024;&#x304C;&#x753B;&#x9762;&#x4E0A;&#x306B;&#x63CF;&#x753B;&#x3055;&#x308C;&#x308B;&#x30BB;&#x30EB;&#x306E;&#x9AD8;&#x3055;&#x3068;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x3002;&#x305D;&#x306E;&#x4ED6;&#x306E;&#x4ED5;&#x69D8;&#x306F;&#x3001;&#x30BB;&#x30EB;&#x5E45;&#x3068;&#x540C;&#x4E00;&#x306E;&#x3082;&#x306E;&#x3068;&#x3059;&#x308B;&#x3002;</p>
<h2 id="&#x63CF;&#x753B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;">&#x63CF;&#x753B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;</h2>
<p>&#x8907;&#x6570;&#x306E;&#x753B;&#x50CF;&#x3092;&#x7DE8;&#x96C6;&#x3059;&#x308B;&#x969B;&#x3001;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x304C;&#x4F34;&#x3046;&#x3068;&#x3001;&#x591A;&#x304F;&#x306E;&#x6642;&#x9593;&#x3092;&#x8981;&#x3057;&#x3066;&#x3057;&#x307E;&#x3046;&#x3002;&#x3088;&#x3063;&#x3066;&#x3001;&#x672C;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F;&#x3001;
&#x300C;&#x63CF;&#x753B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x300D;&#x3068;&#x3044;&#x3046;&#x6A5F;&#x69CB;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3001;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x306A;&#x3057;&#x3067;&#x8907;&#x6570;&#x306E;&#x753B;&#x50CF;&#x3092;&#x6271;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x305F;&#x3002;
&#x63CF;&#x753B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x306F;&#x6587;&#x5B57;&#x901A;&#x308A;&#x63CF;&#x753B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x9023;&#x306D;&#x305F;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x3092;&#x8868;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x6301;&#x3064;&#x3002;</p>
<h3 id="&#x30B5;&#x30E0;&#x30CD;&#x30A4;&#x30EB;">&#x30B5;&#x30E0;&#x30CD;&#x30A4;&#x30EB;</h3>
<p>&#x5404;&#x63CF;&#x753B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x3092;&#x5224;&#x5225;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x3001;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x63CF;&#x753B;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x30B5;&#x30E0;&#x30CD;&#x30A4;&#x30EB;&#x3067;&#x8868;&#x793A;&#x3059;&#x308B;&#x3002;</p>
<h3 id="&#x5207;&#x308A;&#x66FF;&#x3048;">&#x5207;&#x308A;&#x66FF;&#x3048;</h3>
<p>&#x63CF;&#x753B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x306F;&#x305D;&#x308C;&#x305E;&#x308C;&#x5272;&#x308A;&#x5F53;&#x3066;&#x3089;&#x308C;&#x305F;&#x756A;&#x53F7;&#x3068;&#x7D10;&#x3065;&#x3044;&#x3066;&#x304A;&#x308A;&#x3001;&#x305D;&#x308C;&#x305E;&#x308C;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x300C;&#x6570;&#x5B57;&#x30AD;&#x30FC;&#x300D;&#x306B;&#x3088;&#x3063;&#x3066;&#x3082;&#x5207;&#x308A;&#x66FF;&#x3048;&#x3089;&#x308C;&#x308B;&#x3002;
&#x3053;&#x306E;&#x3068;&#x304D;&#x3001;&#x3069;&#x306E;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x3067;&#x73FE;&#x5728;&#x63CF;&#x753B;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x304C;&#x660E;&#x78BA;&#x306B;&#x306A;&#x308B;&#x3088;&#x3046;&#x3001;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x306A;&#x3082;&#x306E;&#x306F;&#x3001;&#x80CC;&#x666F;&#x8272;&#x3092;&#x5909;&#x52D5;&#x3055;&#x305B;&#x308B;&#x3082;&#x306E;&#x3068;&#x3057;&#x305F;&#x3002;</p>
<h2 id="&#x30AF;&#x30EA;&#x30C3;&#x30D7;&#x30DC;&#x30FC;&#x30C9;&#x30B3;&#x30D4;&#x30FC;">&#x30AF;&#x30EA;&#x30C3;&#x30D7;&#x30DC;&#x30FC;&#x30C9;&#x30B3;&#x30D4;&#x30FC;</h2>
<p>&#x753B;&#x9762;&#x53F3;&#x4E0B;&#x306E;&#x300C;Copy&#x300D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3001;&#x307E;&#x305F;&#x306F;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x4E0B;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x30AF;&#x30EA;&#x30C3;&#x30D7;&#x30DC;&#x30FC;&#x30C9;&#x306B;&#x3001;
&#x73FE;&#x5728;&#x306E;&#x63CF;&#x753B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x30B3;&#x30D4;&#x30FC;&#x3059;&#x308B;&#x3002;
&#x30AF;&#x30EA;&#x30C3;&#x30D7;&#x30DC;&#x30FC;&#x30C9;&#x3078;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x306F;&#x8996;&#x899A;&#x7684;&#x306B;&#x306F;&#x6210;&#x529F;&#x3057;&#x305F;&#x304B;&#x5224;&#x5225;&#x3067;&#x304D;&#x306A;&#x3044;&#x305F;&#x3081;&#x3001;&#x30B3;&#x30D4;&#x30FC;&#x5F8C;&#x306B;&#x306F;&#x3001;&#x6975;&#x5C0F;&#x6642;&#x9593;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3068;&#x3057;&#x3066;&#x3001;&#x30B3;&#x30D4;&#x30FC;&#x304C;&#x5B8C;&#x4E86;&#x3057;&#x305F;&#x65E8;&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;&#x3002;</p>
<h2 id="&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x30AD;&#x30FC;">&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x30AD;&#x30FC;</h2>
<p>&#x4E0A;&#x8A18;&#x306E;&#x591A;&#x304F;&#x306E;&#x4F5C;&#x696D;&#x306F;&#x3001;&#x30DE;&#x30A6;&#x30B9;&#x306E;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3092;&#x4F34;&#x3063;&#x3066;&#x3044;&#x3066;&#x306F;&#x3001;&#x6642;&#x9593;&#x304C;&#x639B;&#x304B;&#x3063;&#x3066;&#x3057;&#x307E;&#x3046;&#x305F;&#x3081;&#x3001;&#x5404;&#x3005;&#x306E;&#x64CD;&#x4F5C;&#x3092;&#x3001;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x4E0B;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3082;&#x53EF;&#x80FD;&#x3068;&#x3057;&#x305F;&#x3002;
&#x305F;&#x3060;&#x3057;&#x3001;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3092;&#x5165;&#x529B;&#x4E2D;&#x306E;&#x9593;&#x306F;&#x3001;&#x5165;&#x529B;&#x3057;&#x305F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306B;&#x3088;&#x3063;&#x3066;&#x610F;&#x56F3;&#x3057;&#x306A;&#x3044;&#x6A5F;&#x80FD;&#x304C;&#x767A;&#x706B;&#x3059;&#x308B;&#x304A;&#x305D;&#x308C;&#x304C;&#x3042;&#x308B;&#x305F;&#x3081;&#x3001;&#x5F53;&#x8A72;&#x6A5F;&#x80FD;&#x3092;&#x7121;&#x52B9;&#x5316;&#x3055;&#x305B;&#x308B;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x3067;&#x306F;&#x3001;&#x5404;&#x6A5F;&#x80FD;&#x3068;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x30AD;&#x30FC;&#x3092;&#x8A18;&#x8FF0;&#x3059;&#x308B;&#x3002;&#x307E;&#x305F;&#x3001;&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x30AD;&#x30FC;&#x3068;&#x6A5F;&#x80FD;&#x306E;&#x5BFE;&#x5FDC;&#x306F;&#x3001;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x5185;&#x3067;&#x3001;&#x753B;&#x9762;&#x5DE6;&#x4E0B;&#x306E;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3078;&#x30D5;&#x30A9;&#x30FC;&#x30AB;&#x30B9;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3082;&#x53C2;&#x7167;&#x3067;&#x304D;&#x308B;&#x3002;</p>
<ul>
<li>&#x67A0;: R(Rectangle &#x56DB;&#x89D2;)</li>
<li>&#x30C6;&#x30AD;&#x30B9;&#x30C8;: T(Text) &#x203B;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x5165;&#x529B;&#x306F;&#x300C;Esc&#x300D;&#x30AD;&#x30FC;&#x3067;&#x3082;&#x89E3;&#x9664;&#x53EF;&#x80FD;&#x3068;&#x3059;&#x308B;</li>
<li>&#x5439;&#x304D;&#x51FA;&#x3057;: W(Word Balloon &#x5439;&#x304D;&#x51FA;&#x3057;&#x306E;&#x82F1;&#x8A9E;)</li>
<li>&#x753B;&#x50CF;: I(Image)</li>
<li>&#x79FB;&#x52D5;: M(Mode)</li>
<li><p>&#x524A;&#x9664;: D(Delete)</p>
</li>
<li><p>&#x63CF;&#x753B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;: 1~9&#x306E;&#x6570;&#x5B57;&#x304C;&#x5404;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x3068;&#x5BFE;&#x5FDC;</p>
</li>
<li>&#x753B;&#x50CF;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30D7;&#x30DC;&#x30FC;&#x30C9;&#x306B;&#x30B3;&#x30D4;&#x30FC;: C(Copy)</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="view.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: View">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Function","level":"1.4","depth":1,"previous":{"title":"View","level":"1.3","depth":1,"path":"docs/view.md","ref":"docs/view.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"ja","gitbook":"*"},"file":{"path":"docs/function.md","mtime":"2020-01-13T08:09:55.716Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-13T08:24:26.955Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

